Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
nged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2368809027499299587" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/02f60c6fd1b4111df98fc6415d0adf9ad374fc7f70043a7495bb4cae4e60073c.zip" -> "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.zip"
          ~ "timestamp" = "1758508636578043000" -> "1758772642664816000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4833583308752394486" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598181234816000" -> "1758772642161426000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8811689463934214829" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180859624000" -> "1758772642747098000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4680207113393707169" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292518605725000" -> "1758772641372600000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/eefbe5537b3ebd0ba7a0af876384ce8d4a9f4a883971cc3747abb737ae01e372.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-17T08:44:35.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/eefbe5537b3ebd0ba7a0af876384ce8d4a9f4a883971cc3747abb737ae01e372.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/eefbe5537b3ebd0ba7a0af876384ce8d4a9f4a883971cc3747abb737ae01e372.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "390270291460702578" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/eefbe5537b3ebd0ba7a0af876384ce8d4a9f4a883971cc3747abb737ae01e372.zip"
          ~ "timestamp" = "1751598180850831000" -> "1758772641327224000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1366393103849970408" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292517936575800" -> "1758772641541150000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4070422545331245385" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1734495186214723200" -> "1758772641737706800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1990880547733910067" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598179837004800" -> "1758772642454287000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5500405038442587788" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180671036000" -> "1758772642135009000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7982364795509761812" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1737448472789048000" -> "1758772642759720000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1763419363725647721" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292517221816000" -> "1758772641460704000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "744614199742123799" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739950386465660000" -> "1758772641427188000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1188359493279555700" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180250890000" -> "1758772641855863000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6013374098159483907" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748396983081240800" -> "1758772641724331000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4250535974323216930" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742181576398202000" -> "1758772642330568000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "992040923457377070" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742181577061003000" -> "1758772641778575800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:b9d2c37590fe3c48ceb5e5b452386255e2a1c51b3da3d7aaa0ed3cfc7db3a33b" -> (known after apply)
      ~ last_modified                  = "2025-09-17T08:44:44.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1306489688188612194" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080898092570000" -> "1758772642236996800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66" -> (known after apply)
      ~ code_sha256                 = "igTE57sYZ1CsFjeJ7gaBPKBk25tTq+9e7gvXzF81GxA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T05:52:20.437+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:66" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398778 -> (known after apply)
      ~ version                     = "66" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "5472c1364d0203dcd712fa65adaff731-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> (known after apply)
      ~ key                           = "builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9013671634351355598" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/dee547cfc06c08ece79ebfc2d621c35cc94e9d2b6c914394546a23ca56f3ec0b.zip" -> "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip"
          ~ "timestamp" = "1758088183721438000" -> "1758772658559762000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34" -> (known after apply)
      ~ code_sha256                 = "qe0BD1dsTOS5RWWGusw9C1jZzODJMyIGmm+rvoXYONM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T08:44:12.161+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:34" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/ad62e25bb1d1a7b84ea8a196bc868d5596e2008cc68918e2087f9db25ff63ba0.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 39435 -> (known after apply)
      ~ version                     = "34" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "a0ba0189bff09b03d7e41589571d0459" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ key                           = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/ad62e25bb1d1a7b84ea8a196bc868d5596e2008cc68918e2087f9db25ff63ba0.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/ad62e25bb1d1a7b84ea8a196bc868d5596e2008cc68918e2087f9db25ff63ba0.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ad62e25bb1d1a7b84ea8a196bc868d5596e2008cc68918e2087f9db25ff63ba0.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ad62e25bb1d1a7b84ea8a196bc868d5596e2008cc68918e2087f9db25ff63ba0.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7618067917688549593" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/ad62e25bb1d1a7b84ea8a196bc868d5596e2008cc68918e2087f9db25ff63ba0.zip"
          ~ "timestamp" = "1758080898094948000" -> "1758772642641735000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "security-sendSecurityAlert"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "security-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GASPI_ADMIN_EMAIL" = "devops@xapiens.id" -> "brendan.hosking@csiro.au"
              ~ "SES_SOURCE_EMAIL"  = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4488229160437384110" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1746500163130550000" -> "1758772641714176000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "f9c17acafeac9801cc6f0acdacab135457f90920"
        }

      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:86abe8d3e61240088a42193b4841df16585f06fe2d9528edee94a1e748d9274d" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:86abe8d3e61240088a42193b4841df16585f06fe2d9528edee94a1e748d9274d" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "dac6b4856aceea26819187a71c2039dd175e2bbe" -> "f9c17acafeac9801cc6f0acdacab135457f90920"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "2a59e9ac7b989c05965d05bc34be6d5563af639d"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:bb6b51e5a9db89e0faa6e0f312c31895dcd99ab4370569ddc8fbdab97bf29675" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:bb6b51e5a9db89e0faa6e0f312c31895dcd99ab4370569ddc8fbdab97bf29675" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "6c4d96f803c217845ee91c144ffa73c17bd512ee" -> "2a59e9ac7b989c05965d05bc34be6d5563af639d"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7794161285814032736" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753928922753800000" -> "1758772649435994000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2352576012106905925" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753928923061675000" -> "1758772646513913000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3415458276826653134" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908990909000" -> "1758772646828721000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1229429640374266393" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909079166800" -> "1758772652262658200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5640641743544315098" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909271470000" -> "1758772648716572000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3832487766868513479" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908869195000" -> "1758772649515199000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2501910734799886106" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909002063000" -> "1758772646168337200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7829874712274340194" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908447426000" -> "1758772648610295000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/bad3415550ced4a6beaf9659c18f8ea3225f37792fd8d8e61e5e833d4706a45a.zip" -> "builds/2767310c6e37ccf89cd8793ba6639bd03c8671bb51b3a91f4de5a87b93dca990.zip"
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-09-17T08:44:23.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2767310c6e37ccf89cd8793ba6639bd03c8671bb51b3a91f4de5a87b93dca990.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2767310c6e37ccf89cd8793ba6639bd03c8671bb51b3a91f4de5a87b93dca990.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9210541488426960555" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bad3415550ced4a6beaf9659c18f8ea3225f37792fd8d8e61e5e833d4706a45a.zip" -> "builds/2767310c6e37ccf89cd8793ba6639bd03c8671bb51b3a91f4de5a87b93dca990.zip"
          ~ "timestamp" = "1758080909272576000" -> "1758772652461366000"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTERS"                    = jsonencode(
                  ~ {
                      ~ consequence_rank = 14 -> 12
                      ~ min_qual         = 10 -> 0
                        # (3 unchanged attributes hidden)
                    }
                )
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1617846824005225479" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908460342000" -> "1758772647115048800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "289471293045235662" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909059266000" -> "1758772646541724000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4825164125081045346" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908663704000" -> "1758772652527760000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:86abe8d3e61240088a42193b4841df16585f06fe2d9528edee94a1e748d9274d" -> (known after apply)
      ~ last_modified                  = "2025-09-17T05:18:34.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTER_CONSEQUENCE_RANK"         = "14" -> "12"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3351068757711646136" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908539043000" -> "1758772646757102000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "33941513279991897" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909382594200" -> "1758772647364511000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1bbca2f0065dc117132bea72e9ecf2b8f7f5ccf0e44856b171832a7edca01727.zip" -> "builds/7c994c4dd28ce33c9c83d5e92ffdc1138e56f733db9a49b947831ffc893825c7.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-09-17T08:44:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7c994c4dd28ce33c9c83d5e92ffdc1138e56f733db9a49b947831ffc893825c7.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7c994c4dd28ce33c9c83d5e92ffdc1138e56f733db9a49b947831ffc893825c7.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6490089679236064760" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1bbca2f0065dc117132bea72e9ecf2b8f7f5ccf0e44856b171832a7edca01727.zip" -> "builds/7c994c4dd28ce33c9c83d5e92ffdc1138e56f733db9a49b947831ffc893825c7.zip"
          ~ "timestamp" = "1758080909459730000" -> "1758772648530327000"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:bb6b51e5a9db89e0faa6e0f312c31895dcd99ab4370569ddc8fbdab97bf29675" -> (known after apply)
      ~ last_modified                  = "2025-09-17T07:22:27.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8622304152912603379" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1752130792776662200" -> "1758772649343653000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4045000721969498571" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909219813200" -> "1758772649347262000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:55",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTER_MIN_QUAL"                 = "10" -> "0"
                # (9 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1776376401560736370" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908546866000" -> "1758772647262966000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:61",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.arch
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.